espressif/esp-idf/components/soc/esp32h4/register/soc/hp_system_reg.h
/** HP_SYSTEM_HP_PERI_PMS_EXCEPTION_INFO_REG register
 *  HP Peripherals PMS exception info record register
 */
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_INFO_REG (DR_REG_HP_SYSTEM_BASE + 0x9c)
/** HP_SYSTEM_HP_PERI_PMS_EXCEPTION_DET : RO; bitpos: [0]; default: 0;
 *  Represents whether the hp peripheral pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_DET    (BIT(0))
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_DET_M  (HP_SYSTEM_HP_PERI_PMS_EXCEPTION_DET_V << HP_SYSTEM_HP_PERI_PMS_EXCEPTION_DET_S)
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_DET_V  0x00000001U
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_DET_S  0
/** HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ID : RO; bitpos: [5:1]; default: 0;
 *  Represents the master id when hp peripheral pms has been triggered.
 */
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ID    0x0000001FU
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ID_M  (HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ID_V << HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ID_S)
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ID_V  0x0000001FU
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ID_S  1
/** HP_SYSTEM_HP_PERI_PMS_EXCEPTION_MODE : RO; bitpos: [7:6]; default: 0;
 *  Represents the security mode when hp peripheral pms has been triggered.
 */
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_MODE    0x00000003U
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_MODE_M  (HP_SYSTEM_HP_PERI_PMS_EXCEPTION_MODE_V << HP_SYSTEM_HP_PERI_PMS_EXCEPTION_MODE_S)
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_MODE_V  0x00000003U
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_MODE_S  6
/** HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ADDR : RO; bitpos: [31:8]; default: 0;
 *  Represents the access address (bit23~bit0) when hp peripheral pms has been
 *  triggered.
 */
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ADDR    0x00FFFFFFU
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ADDR_M  (HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ADDR_V << HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ADDR_S)
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ADDR_V  0x00FFFFFFU
#define HP_SYSTEM_HP_PERI_PMS_EXCEPTION_ADDR_S  8

/** HP_SYSTEM_MODEM_PERI_PMS_CONF_REG register
 *  MODEM Peripherals PMS configuration register
 */
#define HP_SYSTEM_MODEM_PERI_PMS_CONF_REG (DR_REG_HP_SYSTEM_BASE + 0xa0)
/** HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear modem peri_pms_record_reg.
 *  0: No clear
 *  1: Clear peri_pms_record_reg
 */
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_CLR    (BIT(0))
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_CLR_M  (HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_CLR_V << HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_CLR_S)
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_CLR_V  0x00000001U
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_CLR_S  0

/** HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_INFO_REG register
 *  MODEM Peripherals PMS exception info record register
 */
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_INFO_REG (DR_REG_HP_SYSTEM_BASE + 0xa4)
/** HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_DET : RO; bitpos: [0]; default: 0;
 *  Represents whether the modem peripheral pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_DET    (BIT(0))
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_DET_M  (HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_DET_V << HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_DET_S)
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_DET_V  0x00000001U
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_DET_S  0
/** HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ID : RO; bitpos: [5:1]; default: 0;
 *  Represents the master id when modem peripheral pms has been triggered.
 */
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ID    0x0000001FU
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ID_M  (HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ID_V << HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ID_S)
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ID_V  0x0000001FU
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ID_S  1
/** HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_MODE : RO; bitpos: [7:6]; default: 0;
 *  Represents the security mode when modem peripheral pms has been triggered.
 */
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_MODE    0x00000003U
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_MODE_M  (HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_MODE_V << HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_MODE_S)
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_MODE_V  0x00000003U
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_MODE_S  6
/** HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ADDR : RO; bitpos: [31:8]; default: 0;
 *  Represents the access address (bit23~bit0) when modem peripheral pms has been
 *  triggered.
 */
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ADDR    0x00FFFFFFU
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ADDR_M  (HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ADDR_V << HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ADDR_S)
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ADDR_V  0x00FFFFFFU
#define HP_SYSTEM_MODEM_PERI_PMS_EXCEPTION_ADDR_S  8

/** HP_SYSTEM_PERI_PMS_INT_EN_REG register
 *  APM interrupt enable register
 */
#define HP_SYSTEM_PERI_PMS_INT_EN_REG (DR_REG_HP_SYSTEM_BASE + 0xa8)
/** HP_SYSTEM_HP_PERI_PMS_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures to enable hp peri pms interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_SYSTEM_HP_PERI_PMS_INT_EN    (BIT(0))
#define HP_SYSTEM_HP_PERI_PMS_INT_EN_M  (HP_SYSTEM_HP_PERI_PMS_INT_EN_V << HP_SYSTEM_HP_PERI_PMS_INT_EN_S)
#define HP_SYSTEM_HP_PERI_PMS_INT_EN_V  0x00000001U
#define HP_SYSTEM_HP_PERI_PMS_INT_EN_S  0
/** HP_SYSTEM_CPU_PERI_PMS_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures to enable cpu peri pms interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_SYSTEM_CPU_PERI_PMS_INT_EN    (BIT(1))
#define HP_SYSTEM_CPU_PERI_PMS_INT_EN_M  (HP_SYSTEM_CPU_PERI_PMS_INT_EN_V << HP_SYSTEM_CPU_PERI_PMS_INT_EN_S)
#define HP_SYSTEM_CPU_PERI_PMS_INT_EN_V  0x00000001U
#define HP_SYSTEM_CPU_PERI_PMS_INT_EN_S  1
/** HP_SYSTEM_MODEM_PERI_PMS_INT_EN : R/W; bitpos: [2]; default: 0;
 *  Configures to enable modem peri pms interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_SYSTEM_MODEM_PERI_PMS_INT_EN    (BIT(2))
#define HP_SYSTEM_MODEM_PERI_PMS_INT_EN_M  (HP_SYSTEM_MODEM_PERI_PMS_INT_EN_V << HP_SYSTEM_MODEM_PERI_PMS_INT_EN_S)
#define HP_SYSTEM_MODEM_PERI_PMS_INT_EN_V  0x00000001U
#define HP_SYSTEM_MODEM_PERI_PMS_INT_EN_S  2

/** HP_SYSTEM_CPU_WAKEUP_EVENT_REG register
 *  NA
 */
#define HP_SYSTEM_CPU_WAKEUP_EVENT_REG (DR_REG_HP_SYSTEM_BASE + 0xc0)
/** HP_SYSTEM_CPU0_WAKEUP_EVENT : R/W; bitpos: [0]; default: 0;
 *  Configures the cpu0 to exit WFI mode
 */
#define HP_SYSTEM_CPU0_WAKEUP_EVENT    (BIT(0))
#define HP_SYSTEM_CPU0_WAKEUP_EVENT_M  (HP_SYSTEM_CPU0_WAKEUP_EVENT_V << HP_SYSTEM_CPU0_WAKEUP_EVENT_S)
#define HP_SYSTEM_CPU0_WAKEUP_EVENT_V  0x00000001U
#define HP_SYSTEM_CPU0_WAKEUP_EVENT_S  0
/** HP_SYSTEM_CPU1_WAKEUP_EVENT : R/W; bitpos: [1]; default: 0;
 *  Configures the cpu1 to exit WFI mode
 */
#define HP_SYSTEM_CPU1_WAKEUP_EVENT    (BIT(1))
#define HP_SYSTEM_CPU1_WAKEUP_EVENT_M  (HP_SYSTEM_CPU1_WAKEUP_EVENT_V << HP_SYSTEM_CPU1_WAKEUP_EVENT_S)
#define HP_SYSTEM_CPU1_WAKEUP_EVENT_V  0x00000001U
#define HP_SYSTEM_CPU1_WAKEUP_EVENT_S  1

/** HP_SYSTEM_ID_REG register
 *  ID register
 */
#define HP_SYSTEM_ID_REG (DR_REG_HP_SYSTEM_BASE + 0x3dc)
/** HP_SYSTEM_ROM_ID : RO; bitpos: [27:12]; default: 0;
 *  Represents the ROM ID of chip
 */
#define HP_SYSTEM_ROM_ID    0x0000FFFFU
#define HP_SYSTEM_ROM_ID_M  (HP_SYSTEM_ROM_ID_V << HP_SYSTEM_ROM_ID_S)
#define HP_SYSTEM_ROM_ID_V  0x0000FFFFU
#define HP_SYSTEM_ROM_ID_S  12

/** HP_SYSTEM_RST_EN_REG register
 *  PCR clock gating configure register
 */
#define HP_SYSTEM_RST_EN_REG (DR_REG_HP_SYSTEM_BASE + 0x3f0)
/** HP_SYSTEM_HPSYSREG_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 0 to reset hp_system_reg module
 */
#define HP_SYSTEM_HPSYSREG_RST_EN    (BIT(0))
#define HP_SYSTEM_HPSYSREG_RST_EN_M  (HP_SYSTEM_HPSYSREG_RST_EN_V << HP_SYSTEM_HPSYSREG_RST_EN_S)
#define HP_SYSTEM_HPSYSREG_RST_EN_V  0x00000001U
#define HP_SYSTEM_HPSYSREG_RST_EN_S  0

/** HP_SYSTEM_DATE_REG register
 *  Date control and version control register
 */
#define HP_SYSTEM_DATE_REG (DR_REG_HP_SYSTEM_BASE + 0x3fc)
/** HP_SYSTEM_DATE : R/W; bitpos: [27:0]; default: 38813728;
 *  Version control register.
 */
#define HP_SYSTEM_DATE    0x0FFFFFFFU
#define HP_SYSTEM_DATE_M  (HP_SYSTEM_DATE_V << HP_SYSTEM_DATE_S)
#define HP_SYSTEM_DATE_V  0x0FFFFFFFU
#define HP_SYSTEM_DATE_S  0

#ifdef __cplusplus
}
#endif
